#!/usr/bin/python3

def gama_koujyou():
  print("さあさ、お立ち会い。ご用とお急ぎでない方は　ゆっくりと聞いておいで。")
  print("遠出の山越し笠のうち、聞かざるときは物の黒白、善悪がとんとわからない。")
  print("山寺の鐘がゴオーン、ゴオーンと鳴るといえども、童子きたって鐘に")
  print("撞木を与えずば、とんと鐘の音色がわからない。")
  print("さて、お立ち会い。手前ここに取り出したるは陣中膏、蝦蟇の油。")
  print("さーて、お立ち会い。蝦蟇と申しましてもただの蝦蟇とは蝦蟇が違う。")
  print("関東は筑波山の麓、おんばこという露草を食って育った四六の蝦蟇だ。")
  print("四六五六はどこで見分ける。前足の指が四本、うしろ足の指が六本、")
  print("併せて四六の蝦蟇。山中ふかく分け入って捕らえたこの蝦蟇を、")
  print("四面鏡の箱に入れると、蝦蟇は己の姿が鏡に写るのを見て吃驚仰天、")
  print("タラーリ、タラーリと脂汗を流す。これをすき取り、柳の小枝で三七、")
  print("二十と一日トローリ、トローリと煮詰めましたるがこの陣中膏蝦蟇の油。")
  print("蝦蟇の油の効能は、ひびにあかぎれ、しもやけの妙薬。・・まだある。")
  print("出痔、いぼ痔、はしり痔、はれもの一切。まあ、ちょっとお待ち。")
  print("蝦蟇の油の効能はそればかりかというと、まだある。\n")
  print("切れ物の切れ味をとめるという。手前持ちいだしたるは、鈍刀といえど、")
  print("先が斬れて、元が斬れぬ、半ばが斬れぬというのではない。ごらんの通り、")
  print("抜けば玉散る氷の刃だ、お立会い。取り出したるは夏なお寒き氷の刃！")

def gama_koujyou2():
  print("これこの通り、フウッと散らせば　比良の暮雪は　雪降りの型。")
  print("これなる名刀も、ひとたびこの蝦蟇の油をつけるときは、")
  print("たちまち切れ味が止まる。押しても引いても切れはせぬ。")
  print("と言うても、なまくらになったのではないぞー、お立ち会い！")
  print("このようにきれいにふき取るときは、もとの切れ味になって、")
  print("これこのとおり。")
  print("さてお立ち会い。蝦蟇の油の効能が分かったら遠慮はご無用。")
  print("どんどん買ってお行きやれ・・・")

if __name__=="__main__":
  gama_koujyou()
  print("Hit enter key")
  input()
  for k in range (100):
    print(2**k,"枚が",2**(k+1),"枚、",sep="")
  gama_koujyou2()

